# Практическое задание 4 - Все варианты

# Вариант 1
print("=== Вариант 1 ===")

# Задание 1
num = int(input("Введите число: "))
if num < 0:
    num = -num
    print(num)
elif num == 0:
    num = 1
    print(num)
else:
    print(num)

# Задание 2
text = input("Введите строку: ")
if '.' in text or ',' in text:
    print(True)
else:
    print(False)

# Задание 3
num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
if num1 % 3 == 0 and num2 % 3 == 0:
    print(True)
elif num1 % 3 == 0 or num2 % 3 == 0:
    print("Одно число делится на 3")
else:
    print(False)

# Вариант 2
print("\n=== Вариант 2 ===")

# Задание 1
num = int(input("Введите число: "))
if num > 100:
    print("*")
elif num > 0:
    print("*" * num)

# Задание 2
str1 = input("Первая строка: ")
str2 = input("Вторая строка: ")
if str1 == str2:
    print(True)
else:
    print(False)

# Задание 3
r = int(input("R: "))
g = int(input("G: "))
b = int(input("B: "))
if r == 0 and g == 0 and b == 0:
    print("Чёрный цвет")
elif r == 255 and g == 255 and b == 255:
    print("Белый цвет")
elif r == 255 and g == 0 and b == 0:
    print("Красный цвет")
elif r == 0 and g == 255 and b == 0:
    print("Зелёный цвет")
elif r == 0 and g == 0 and b == 255:
    print("Синий цвет")
else:
    print("Нет цвета")

# Вариант 3
print("\n=== Вариант 3 ===")

# Задание 1
num = int(input("Введите число: "))
if num > 0:
    print(num-1, num, num+1)
else:
    num = 1
    print(num-1, num, num+1)

# Задание 2
filename = input("Имя файла: ")
if filename.endswith('.doc'):
    print("Word file")
elif filename.endswith('.py'):
    print("Python file")
elif filename.endswith('.txt'):
    print("Text file")
else:
    print("Неизвестный формат")

# Задание 3
a = float(input("Сторона a: "))
b = float(input("Сторона b: "))
c = float(input("Сторона c: "))
if a == b == c:
    print("Равносторонний")
elif a == b or a == c or b == c:
    print("Равнобедренный")
else:
    print("Разносторонний")

# Вариант 4
print("\n=== Вариант 4 ===")

# Задание 1
text = 'important information in one line'
letter = input("Введите букву: ")
if letter in text:
    print(True)
else:
    print(False)

# Задание 2
side1 = float(input("Первая сторона: "))
side2 = float(input("Вторая сторона: "))
if side1 == side2:
    print("Квадрат, площадь:", side1 * side2)
else:
    print("Прямоугольник, площадь:", side1 * side2)

# Задание 3
answer = input("Как твои дела? ")
if answer in ["хорошо", "нормально", "отлично"]:
    print("😊")
elif answer in ["плохо", "не хорошо", "..."]:
    print("😢")
else:
    print("😐")

# Вариант 5
print("\n=== Вариант 5 ===")

# Задание 1
num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
if num1 > num2:
    print(num1 ** num2)
elif num2 > num1:
    print(num2 ** num1)
else:
    print(num1 + num2)

# Задание 2
new_message = "Hello! How are you?"
user_answer = input("Введите ответ: ")
if new_message[0] == user_answer[0]:
    print(True)
else:
    print(False)

# Задание 3
segment1 = float(input("Длина первого отрезка: "))
segment2 = float(input("Длина второго отрезка: "))
if segment1 > segment2:
    print("Первый отрезок длиннее на", segment1 - segment2)
elif segment2 > segment1:
    print("Второй отрезок длиннее на", segment2 - segment1)
else:
    print("Отрезки равны")

# Вариант 6
print("\n=== Вариант 6 ===")

# Задание 1
text = input("Введите строку: ")
if text[0] == text[-1]:
    print(True)
else:
    print(False)

# Задание 2
num = int(input("Введите число: "))
if num % 2 == 0:
    print(num ** 2)
elif num % 3 == 0:
    print(num ** 3)
else:
    print(num * 100)

# Задание 3
num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
if num1 < 0 and num2 < 0:
    print(False)
elif num1 < 0:
    num1 += 1000
    print(num1, num2)
elif num2 < 0:
    num2 += 1000
    print(num1, num2)
else:
    print(True)

# Вариант 7
print("\n=== Вариант 7 ===")

# Задание 1
text = input("Введите строку: ")
if text[-1] in ['я', 'и', 'е', 'ю']:
    print(True)
else:
    print(False)

# Задание 2
a = float(input("Сторона a: "))
b = float(input("Сторона b: "))
c = float(input("Сторона c: "))
if a > 0 and b > 0 and c > 0:
    if a + b > c and a + c > b and b + c > a:
        print(True)
    else:
        print(False)
else:
    print(False)

# Задание 3
num = int(input("Введите число: "))
last_digit = num % 10
if last_digit == 0:
    print(num ** 10)
elif last_digit == 1:
    print(num % 3)
elif last_digit == 2:
    print(num // 2)
else:
    print(num ** 2)

# Вариант 8
print("\n=== Вариант 8 ===")

# Задание 1
password = input("Введите пароль: ")
if len(password) < 8 or password == "qwerty123":
    print(False)
else:
    print(True)

# Задание 2
pc_number = 777
num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
if (num1 < pc_number < num2) or (num2 < pc_number < num1):
    print(True)
else:
    print(False)

# Задание 3
lamp_1 = 0
lamp_2 = 0
choice = input("Какую лампочку зажечь? ")
if choice == "1":
    lamp_1 = 1
    print("Лампочка 1 горит")
elif choice == "2":
    lamp_2 = 1
    print("Лампочка 2 горит")
else:
    print("Обе лампочки не горят")

# Вариант 9
print("\n=== Вариант 9 ===")

# Задание 1
switch_1 = False
switch_2 = False
answer = input("Включить? ")
if answer == "да":
    switch_1 = True
    switch_2 = True
    print("Всё включено")
    print("switch_1 =", switch_1)
    print("switch_2 =", switch_2)
else:
    print("switch_1 =", switch_1)
    print("switch_2 =", switch_2)

# Задание 2
num = int(input("Введите число: "))
if num > 0:
    if num % 2 == 0:
        print(True, "even")
    else:
        print(True, "odd")
else:
    print(False)

# Задание 3
text = input("Введите строку: ")
if text.startswith('/'):
    print("command")
else:
    print("It's string")

# Вариант 10
print("\n=== Вариант 10 ===")

# Задание 1
text = input("Введите строку: ")
length = len(text)
if length == 0:
    print(None)
elif length <= 5:
    print("short")
elif 6 <= length <= 10:
    print("normal")
else:
    print("long")

# Задание 2
num = int(input("Введите число: "))
if num < 0:
    num = 1000000
    print(num)
elif num == 0:
    num = 2
    print(num ** 2)
else:
    print(num ** 3)

# Задание 3
number_1 = 10
number_2 = 100
user_num = int(input("Введите число: "))
if number_1 < user_num < number_2:
    print(True)
else:
    print(False)

# Вариант 11
print("\n=== Вариант 11 ===")

# Задание 1
prog_num = 0
num1 = int(input("Первое число: "))
num2 = int(input("Второе число: "))
if num1 < 0 and num2 < 0:
    prog_num = num1 + num2
    print(prog_num)
elif num1 > 0 and num2 > 0:
    prog_num = num1 - num2
    print(prog_num)
else:
    print(False)

# Задание 2
num = int(input("Введите число: "))
if num % 2 == 1:
    num += 1
    print(num)
else:
    print(True)

# Задание 3
text = input("Введите строку: ")
if len(text) > 10:
    print(text[:5])
else:
    print(text)

# Вариант 12
print("\n=== Вариант 12 ===")

# Задание 1
ru = 'a6Brдеёжзийклинопрстуфхцчищbblbэюя'
en = 'abcdefghijklmnopqrstuvwxyz'
letter = input("Введите букву: ")
if letter in ru:
    print("rus")
elif letter in en:
    print("eng")
else:
    print(None)

# Задание 2
pc_num = 10
user_num = int(input("Введите число: "))
if user_num == pc_num or user_num == pc_num-1 or user_num == pc_num+1:
    print(True)
else:
    print(False)

# Задание 3
print('(221 - 13) * 2')
correct_answer = (221 - 13) * 2
user_answer = int(input("Ваш ответ: "))
if user_answer == correct_answer:
    print(True)
elif user_answer > correct_answer:
    print(">")
else:
    print("<")
